MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK30DX128VLQ10/mcu.h
/* The count of SYSMPU_RGDAAC */
#define SYSMPU_RGDAAC_COUNT                      (12U)


/*!
 * @}
 */ /* end of group SYSMPU_Register_Masks */


/* SYSMPU - Peripheral instance base addresses */
/** Peripheral SYSMPU base address */
#define SYSMPU_BASE                              (0x4000D000u)
/** Peripheral SYSMPU base pointer */
#define SYSMPU                                   ((SYSMPU_Type *)SYSMPU_BASE)
/** Array initializer of SYSMPU peripheral base addresses */
#define SYSMPU_BASE_ADDRS                        { SYSMPU_BASE }
/** Array initializer of SYSMPU peripheral base pointers */
#define SYSMPU_BASE_PTRS                         { SYSMPU }

/*!
 * @}
 */ /* end of group SYSMPU_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- TSI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TSI_Peripheral_Access_Layer TSI Peripheral Access Layer
 * @{
 */

/** TSI - Register Layout Typedef */
typedef struct {
  __IO uint32_t GENCS;                             /**< General Control and Status register, offset: 0x0 */
  __IO uint32_t SCANC;                             /**< SCAN Control register, offset: 0x4 */
  __IO uint32_t PEN;                               /**< Pin Enable register, offset: 0x8 */
  __I  uint32_t WUCNTR;                            /**< Wake-Up Channel Counter Register, offset: 0xC */
       uint8_t RESERVED_0[240];
  __I  uint32_t CNTR1;                             /**< Counter Register, offset: 0x100 */
  __I  uint32_t CNTR3;                             /**< Counter Register, offset: 0x104 */
  __I  uint32_t CNTR5;                             /**< Counter Register, offset: 0x108 */
  __I  uint32_t CNTR7;                             /**< Counter Register, offset: 0x10C */
  __I  uint32_t CNTR9;                             /**< Counter Register, offset: 0x110 */
  __I  uint32_t CNTR11;                            /**< Counter Register, offset: 0x114 */
  __I  uint32_t CNTR13;                            /**< Counter Register, offset: 0x118 */
  __I  uint32_t CNTR15;                            /**< Counter Register, offset: 0x11C */
  __IO uint32_t THRESHOLD;                         /**< Low-Power Channel Threshold register, offset: 0x120 */
} TSI_Type;

/* ----------------------------------------------------------------------------
   -- TSI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TSI_Register_Masks TSI Register Masks
 * @{
 */

/*! @name GENCS - General Control and Status register */
#define TSI_GENCS_STPE_MASK                      (0x1U)
#define TSI_GENCS_STPE_SHIFT                     (0U)
#define TSI_GENCS_STPE(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_STPE_SHIFT)) & TSI_GENCS_STPE_MASK)
#define TSI_GENCS_STM_MASK                       (0x2U)
#define TSI_GENCS_STM_SHIFT                      (1U)
#define TSI_GENCS_STM(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_STM_SHIFT)) & TSI_GENCS_STM_MASK)
#define TSI_GENCS_ESOR_MASK                      (0x10U)
#define TSI_GENCS_ESOR_SHIFT                     (4U)
#define TSI_GENCS_ESOR(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_ESOR_SHIFT)) & TSI_GENCS_ESOR_MASK)
#define TSI_GENCS_ERIE_MASK                      (0x20U)
#define TSI_GENCS_ERIE_SHIFT                     (5U)
#define TSI_GENCS_ERIE(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_ERIE_SHIFT)) & TSI_GENCS_ERIE_MASK)
#define TSI_GENCS_TSIIE_MASK                     (0x40U)
#define TSI_GENCS_TSIIE_SHIFT                    (6U)
#define TSI_GENCS_TSIIE(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_TSIIE_SHIFT)) & TSI_GENCS_TSIIE_MASK)
#define TSI_GENCS_TSIEN_MASK                     (0x80U)
#define TSI_GENCS_TSIEN_SHIFT                    (7U)
#define TSI_GENCS_TSIEN(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_TSIEN_SHIFT)) & TSI_GENCS_TSIEN_MASK)
#define TSI_GENCS_SWTS_MASK                      (0x100U)
#define TSI_GENCS_SWTS_SHIFT                     (8U)
#define TSI_GENCS_SWTS(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_SWTS_SHIFT)) & TSI_GENCS_SWTS_MASK)
#define TSI_GENCS_SCNIP_MASK                     (0x200U)
#define TSI_GENCS_SCNIP_SHIFT                    (9U)
#define TSI_GENCS_SCNIP(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_SCNIP_SHIFT)) & TSI_GENCS_SCNIP_MASK)
#define TSI_GENCS_OVRF_MASK                      (0x1000U)
#define TSI_GENCS_OVRF_SHIFT                     (12U)
#define TSI_GENCS_OVRF(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_OVRF_SHIFT)) & TSI_GENCS_OVRF_MASK)
#define TSI_GENCS_EXTERF_MASK                    (0x2000U)
#define TSI_GENCS_EXTERF_SHIFT                   (13U)
#define TSI_GENCS_EXTERF(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_EXTERF_SHIFT)) & TSI_GENCS_EXTERF_MASK)
#define TSI_GENCS_OUTRGF_MASK                    (0x4000U)
#define TSI_GENCS_OUTRGF_SHIFT                   (14U)
#define TSI_GENCS_OUTRGF(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_OUTRGF_SHIFT)) & TSI_GENCS_OUTRGF_MASK)
#define TSI_GENCS_EOSF_MASK                      (0x8000U)
#define TSI_GENCS_EOSF_SHIFT                     (15U)
#define TSI_GENCS_EOSF(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_EOSF_SHIFT)) & TSI_GENCS_EOSF_MASK)
#define TSI_GENCS_PS_MASK                        (0x70000U)
#define TSI_GENCS_PS_SHIFT                       (16U)
#define TSI_GENCS_PS(x)                          (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_PS_SHIFT)) & TSI_GENCS_PS_MASK)
#define TSI_GENCS_NSCN_MASK                      (0xF80000U)
#define TSI_GENCS_NSCN_SHIFT                     (19U)
#define TSI_GENCS_NSCN(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_NSCN_SHIFT)) & TSI_GENCS_NSCN_MASK)
#define TSI_GENCS_LPSCNITV_MASK                  (0xF000000U)
#define TSI_GENCS_LPSCNITV_SHIFT                 (24U)
#define TSI_GENCS_LPSCNITV(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_LPSCNITV_SHIFT)) & TSI_GENCS_LPSCNITV_MASK)
#define TSI_GENCS_LPCLKS_MASK                    (0x10000000U)
#define TSI_GENCS_LPCLKS_SHIFT                   (28U)
#define TSI_GENCS_LPCLKS(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_LPCLKS_SHIFT)) & TSI_GENCS_LPCLKS_MASK)

/*! @name SCANC - SCAN Control register */
#define TSI_SCANC_AMPSC_MASK                     (0x7U)
#define TSI_SCANC_AMPSC_SHIFT                    (0U)
#define TSI_SCANC_AMPSC(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_SCANC_AMPSC_SHIFT)) & TSI_SCANC_AMPSC_MASK)
#define TSI_SCANC_AMCLKS_MASK                    (0x18U)
#define TSI_SCANC_AMCLKS_SHIFT                   (3U)
#define TSI_SCANC_AMCLKS(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_SCANC_AMCLKS_SHIFT)) & TSI_SCANC_AMCLKS_MASK)
#define TSI_SCANC_SMOD_MASK                      (0xFF00U)
#define TSI_SCANC_SMOD_SHIFT                     (8U)
#define TSI_SCANC_SMOD(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_SCANC_SMOD_SHIFT)) & TSI_SCANC_SMOD_MASK)
#define TSI_SCANC_EXTCHRG_MASK                   (0xF0000U)
#define TSI_SCANC_EXTCHRG_SHIFT                  (16U)
#define TSI_SCANC_EXTCHRG(x)                     (((uint32_t)(((uint32_t)(x)) << TSI_SCANC_EXTCHRG_SHIFT)) & TSI_SCANC_EXTCHRG_MASK)
#define TSI_SCANC_REFCHRG_MASK                   (0xF000000U)
#define TSI_SCANC_REFCHRG_SHIFT                  (24U)
#define TSI_SCANC_REFCHRG(x)                     (((uint32_t)(((uint32_t)(x)) << TSI_SCANC_REFCHRG_SHIFT)) & TSI_SCANC_REFCHRG_MASK)

/*! @name PEN - Pin Enable register */
#define TSI_PEN_PEN0_MASK                        (0x1U)
#define TSI_PEN_PEN0_SHIFT                       (0U)
#define TSI_PEN_PEN0(x)                          (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN0_SHIFT)) & TSI_PEN_PEN0_MASK)
#define TSI_PEN_PEN1_MASK                        (0x2U)
#define TSI_PEN_PEN1_SHIFT                       (1U)
#define TSI_PEN_PEN1(x)                          (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN1_SHIFT)) & TSI_PEN_PEN1_MASK)
#define TSI_PEN_PEN2_MASK                        (0x4U)
#define TSI_PEN_PEN2_SHIFT                       (2U)
#define TSI_PEN_PEN2(x)                          (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN2_SHIFT)) & TSI_PEN_PEN2_MASK)
#define TSI_PEN_PEN3_MASK                        (0x8U)
#define TSI_PEN_PEN3_SHIFT                       (3U)
#define TSI_PEN_PEN3(x)                          (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN3_SHIFT)) & TSI_PEN_PEN3_MASK)
#define TSI_PEN_PEN4_MASK                        (0x10U)
#define TSI_PEN_PEN4_SHIFT                       (4U)
#define TSI_PEN_PEN4(x)                          (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN4_SHIFT)) & TSI_PEN_PEN4_MASK)
#define TSI_PEN_PEN5_MASK                        (0x20U)
#define TSI_PEN_PEN5_SHIFT                       (5U)
#define TSI_PEN_PEN5(x)                          (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN5_SHIFT)) & TSI_PEN_PEN5_MASK)
#define TSI_PEN_PEN6_MASK                        (0x40U)
#define TSI_PEN_PEN6_SHIFT                       (6U)
#define TSI_PEN_PEN6(x)                          (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN6_SHIFT)) & TSI_PEN_PEN6_MASK)
#define TSI_PEN_PEN7_MASK                        (0x80U)
#define TSI_PEN_PEN7_SHIFT                       (7U)
#define TSI_PEN_PEN7(x)                          (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN7_SHIFT)) & TSI_PEN_PEN7_MASK)
#define TSI_PEN_PEN8_MASK                        (0x100U)
#define TSI_PEN_PEN8_SHIFT                       (8U)
#define TSI_PEN_PEN8(x)                          (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN8_SHIFT)) & TSI_PEN_PEN8_MASK)
#define TSI_PEN_PEN9_MASK                        (0x200U)
#define TSI_PEN_PEN9_SHIFT                       (9U)
#define TSI_PEN_PEN9(x)                          (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN9_SHIFT)) & TSI_PEN_PEN9_MASK)
#define TSI_PEN_PEN10_MASK                       (0x400U)
#define TSI_PEN_PEN10_SHIFT                      (10U)
#define TSI_PEN_PEN10(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN10_SHIFT)) & TSI_PEN_PEN10_MASK)
#define TSI_PEN_PEN11_MASK                       (0x800U)
#define TSI_PEN_PEN11_SHIFT                      (11U)
#define TSI_PEN_PEN11(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN11_SHIFT)) & TSI_PEN_PEN11_MASK)
#define TSI_PEN_PEN12_MASK                       (0x1000U)
#define TSI_PEN_PEN12_SHIFT                      (12U)
#define TSI_PEN_PEN12(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN12_SHIFT)) & TSI_PEN_PEN12_MASK)
#define TSI_PEN_PEN13_MASK                       (0x2000U)
#define TSI_PEN_PEN13_SHIFT                      (13U)
#define TSI_PEN_PEN13(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN13_SHIFT)) & TSI_PEN_PEN13_MASK)
#define TSI_PEN_PEN14_MASK                       (0x4000U)
#define TSI_PEN_PEN14_SHIFT                      (14U)
#define TSI_PEN_PEN14(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN14_SHIFT)) & TSI_PEN_PEN14_MASK)
#define TSI_PEN_PEN15_MASK                       (0x8000U)
#define TSI_PEN_PEN15_SHIFT                      (15U)
#define TSI_PEN_PEN15(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_PEN_PEN15_SHIFT)) & TSI_PEN_PEN15_MASK)
#define TSI_PEN_LPSP_MASK                        (0xF0000U)
#define TSI_PEN_LPSP_SHIFT                       (16U)
#define TSI_PEN_LPSP(x)                          (((uint32_t)(((uint32_t)(x)) << TSI_PEN_LPSP_SHIFT)) & TSI_PEN_LPSP_MASK)

/*! @name WUCNTR - Wake-Up Channel Counter Register */
#define TSI_WUCNTR_WUCNT_MASK                    (0xFFFFU)
#define TSI_WUCNTR_WUCNT_SHIFT                   (0U)
#define TSI_WUCNTR_WUCNT(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_WUCNTR_WUCNT_SHIFT)) & TSI_WUCNTR_WUCNT_MASK)

/*! @name CNTR1 - Counter Register */
#define TSI_CNTR1_CTN1_MASK                      (0xFFFFU)
#define TSI_CNTR1_CTN1_SHIFT                     (0U)
#define TSI_CNTR1_CTN1(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_CNTR1_CTN1_SHIFT)) & TSI_CNTR1_CTN1_MASK)
#define TSI_CNTR1_CTN_MASK                       (0xFFFF0000U)
#define TSI_CNTR1_CTN_SHIFT                      (16U)
#define TSI_CNTR1_CTN(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_CNTR1_CTN_SHIFT)) & TSI_CNTR1_CTN_MASK)

/*! @name CNTR3 - Counter Register */
#define TSI_CNTR3_CTN1_MASK                      (0xFFFFU)
#define TSI_CNTR3_CTN1_SHIFT                     (0U)
#define TSI_CNTR3_CTN1(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_CNTR3_CTN1_SHIFT)) & TSI_CNTR3_CTN1_MASK)
#define TSI_CNTR3_CTN_MASK                       (0xFFFF0000U)
#define TSI_CNTR3_CTN_SHIFT                      (16U)
#define TSI_CNTR3_CTN(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_CNTR3_CTN_SHIFT)) & TSI_CNTR3_CTN_MASK)

